Revit 2027 API
EnergyDataSettings.ProjectReportType Property
 Used in Heating and Cooling Loads Analysis (ViewHVACLoadsReport). Report type: None, simple, standard, detailed, compact.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public HVACLoadLoadsReportType ProjectReportType { get; set; }
Public Property ProjectReportType As HVACLoadLoadsReportType
	Get
	Set
public:
property HVACLoadLoadsReportType ProjectReportType {
	HVACLoadLoadsReportType get ();
	void set (HVACLoadLoadsReportType value);
}
member ProjectReportType : HVACLoadLoadsReportType with get, set
Property Value
HVACLoadLoadsReportType
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The project report type does not fall within an appropriate range.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace